<?php#*wataw*

if($start == "non"){
$start = "
- أهلاً بكْ عزيزي !!

- بوت تحليل الشخصيات... !
- يمكنك تحليل شخصيتك بطرقتين ؟.
- الاولى عن طريق الاسئلة العامة ... والثانيه عن طريق الابراج ( برجك )
- الان قم بأختيار احد الطرق وقم بتحليل شخصيتك عن طريق البوت...
";}

// $update = json_decode(file_get_contents('php://input')); (Already handled in mak.php)
$message = $update->message;
$text = $message->text;
$first_name = $message->from->first_name;
$chat_id = $message->chat->id;
$chatid = $update->callback_query->message->chat->id;
$data = $update->callback_query->data;
$message_id = $update->callback_query->message->message_id;
$pr = array("https://f.top4top.net/p_971eoab91.jpg","https://b.top4top.net/p_971ycfjf1.jpg","https://a.top4top.net/p_971famwa1.jpg","https://e.top4top.net/p_971nzudf1.jpg","https://d.top4top.net/p_971dyvl11.jpg");

if($text =='/start' ){
bot('sendMessage',['chat_id'=>$chat_id,
'text'=>"$start

$txtfree",
'parse_mode'=>"html",
'disable_web_page_preview'=>'true',
'reply_to_message_id'=>$message->message_id,
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- ابراج",'callback_data'=>"#1"],['text'=>"- اسئلة",'callback_data'=>"#2"]],
]])]);}

if ($data == "zzzzu"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"$start

$txtfree",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>HTML,
'disable_web_page_preview'=>'true',
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- ابراج",'callback_data'=>"#1"],['text'=>"- اسئلة",'callback_data'=>"#2"]],
]])]);}

if($data == "#1"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"
📣 عزيزي اختار برجك الخاص ليتم تحليل شخصيتك...
🔎 لمعرفة برجك اضغط على الزر في الاسفل...!
",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[["text"=>"- الحمل","callback_data"=>"q1"],["text"=>"- الثور","callback_data"=>"q5"],["text"=>"- الجوزاء","callback_data"=>"q9"]],
[["text"=>"- السرطان","callback_data"=>"q2"],["text"=>"- الاسد","callback_data"=>"q6"],["text"=>"- العذراء","callback_data"=>"q10"]],
[["text"=>"- الميزان","callback_data"=>"q3"],["text"=>"- العقرب","callback_data"=>"q7"],["text"=>"- القوس","callback_data"=>"q11"]],
[["text"=>"- الجدي","callback_data"=>"q4"],["text"=>"- الدلو","callback_data"=>"q8"],["text"=>"- الحوت","callback_data"=>"q12"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q1"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"
👋🏻 اليك تحليل شخصيتك !!
- تتميز شخصيتك بانها شخصية نشيطه ومبتكرة ولك طريقة خاصه في التعامل مع الامور الدنيويه التي تواجهك قد تكون هاذا الطريقة فعاله او قد تسبب لك لكثير من المشاكل ,
 - لديك شخصية عفويه وتلقائيه فانت تندمج مع الاخرين وتبوح لهم الكثير من اسرارك دون ان تلاحظ ذالك ,
- انت تحتاج بعض الوقت في التفكير والتأمل او الانعزال لاعادة ترتيب نفسك بعد كل نكسه تتعرض لها ,
- لديك ذوق جميل في الاختيار واختيار الملابس خاصتا فانت تعمل كي تكون المتميز في هاذا لمجال او وسط اصدقائك.
- تتخذ بعض الوقت لكي تثق الاشخاص الانك شخصيه منفتحة وبعض افكارك مجنونه ولديك الكثير من المساحة مع الاصدقاء المقربون لك.
- انت لا تفكر قبل القيام بالامور مما يعرضك لكثير من الصدمات من الاصدقاء والمقربون رغم صراحتك الزائده الا انك تحضى بتقدير من حولك لك , 
",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q2"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"-  من الشخصيات الهادئة التى تتحلى بالسلام الداخلي كما أنها شغوفة، حساسة وفي بعض الأحيان تكون عنيدة ومتصلبة الرأي إضافة لذلك فهى تمتلك درجة عالية من العزيمة والإصرار في بعض الأحيان تتقوقع بعيدا عن الأخرين فى عالمك الخاص عندما يتم مضايقتك أو استفزازك. وفي هذه الاوقات يظهر الجانب المتشائم والعدواني بكل وضوح فعندما تكره شخص معين، فلن تبذل أي مجهود لإخفاء هذه المشاعر كما قد تفعل في المعتاد ورغم ذلك تعبتر  من أكثر شخصيات الأبراج حساسية واهتماما بالأخرين كما أن تتمتع بمخيلة نشطة وتعشق بجنون ولديهك شعور دائم بالرغبة في حماية الأخرين والإعتناء بهم خاصة أولئك المقربين إلى قلبك عاطفي بدرجة كبيرة فانك تقدّر الزهور والهدايا وتحب قصائد الحب إذا أردت أن تفوز بقلبها عليك إبهارها هي أيضا تحب أن تتمهل وتأخذ وقتا كاف قبل الوقوع في الحب كما أنها تبحث عن شريك حساس المشاعر مثلها ليس من السهل  الوثوق في الأخرين ولكن إذا كنت من الحظوظين الذين نالوا هذه الثقة فسوف تفوز بمساحة كبيرة من قلبها تتميز امراة برج السرطان أيضا بأنها صبورة وتحرص دوما على البقاء بجانب شريك حياتها في أوقات الأزمات وتسعي لمشاركته في تخطي كافة العقبات التى يواجها.وهذا ما يجعلها شريكة فريدة من نوعها تحب امرأة برج السرطان الرجل الذي يعبر عن عواطفة طوال الوقت فيحتضنها من حين لأخر ويعد لها بها عشاءا رومانسيا على أضواء الشموع. كل اهتمامها يتعلق بعائلتها وبيتها، فهى تعطي دوما الأولوية لهم ولأصدقائها المقربين إلى قلبها فتحرص على الأهتمام بهم وتدليلهم وإعطائهم الحب طوال الوقت.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q3"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"- شخصية برج الميزان عادلة وتسعى دوما إلى موازنة الأمور وتحقيق العدالة والإنصاف تتميز أيضا بأنها اجتماعية ولديها مهارات عالية في الاتصال وتُعرف بشخصيتها الساحرة التي تلفت الآخرين إليها بسهولة تقع  في منطقة وسط بين الشخصية العقلانية والشخصية العاطفية وتحاول دوما تحقيق التوازن بينهما بحيث لا تكون عاطفية بدرجة كبيرة أو عقلانية للغاية هي أيضا دبلوماسية تستمع إلى صوت الحق والمنطق لا تمانع من الاعتراف بأخطائها إذا تحدث الآخرين معها بلغة المنطق والعقل شخصيه رائعة تتفهم جيدا وجهات نظر شريك حياتها وتسعى دوما إلى وضع نفسها في مكانه تتقن جيدا فن امتصاص غضب الآخر والحفاظ على الهدوء في كل موقف تمر به ولكن في الوقت ذاته هي تبحث عن شريك يدعمها ويمدحها طوال الوقت لا تقع في علاقة عاطفية بسهولة فهي تفضل أن تعطي نفسها الوقت الكافي لتتأكد من مشاعرها ومن كونه الشخص الأمثل لها تسعى لفعل أي شيء لإسعاد وإرضاء شريك حياتها فهي مخلصة ورومانسية من الدرجة الأولى.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q4"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"شخصية برج الجدي:
تسعى باهتمام لتحقيق النجاح في حياتها سواء على المستوى المهني أو العائلي من خلال إدارة منزلها بشكل حكيم أهدافها منظمة وتتبنى دوما وجهات نظر عملية ولديها طريقة دبلوماسية في التفكير والتعامل مع الآخرين لديها قدرة عالية على التحكم في نفسها وتميل إلى إظهار جانبها المرح والجريء فقط للأشخاص المقربين إلى قلبها تتميز بأنها شخصية متواضعة وصبورة وتشعر بالمسؤولية تجاه غيرها كما أنها من الشخصيات التي تحفز نفسها باستمرار قد يأخذ الآخرين بعض الوقت لفهم طبيعتها إلى أن تقوم بفتح قلبها لهم
رغم أن برج الجدي لا تستطيع التعبير عن مشاعرها بشكل جيد إلا أنها رومانسية وعاطفية للغاية تكمن قوتها الكامنة في قدرتها على وضع أهداف طويلة المدى والإصرار على تحقيقها والوصول إليها.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q5"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"- شخصية الثور:
تتميز شخصيتك بروحها الجميلة وامتلاكها لحس فكاهي يأسر المحيطين بها ورغم أنها تميل إلى أن النمط الحساس من الشخصيات، إلا انها تحاول دوما إخفاء هذا الجانب. شخصيتك أيضا شخصية عنيدة مليئة بالإصرار والعزيمة تعرف جيدا ما تريد تحقيقة وتبذل قصاري جهدها للوصول إليه، في بعض الأحيان يراها البعض مجنونة لمحاولاتها المستميته والغير متوقعة لتحقيق هدفها تعد شخصيتك واحدة من أكثر الشخصيات العنيدة والمتصلبة الرأي التى يمكن أن تقابلها فى الحياة، تميل أيضا إلى أن تكون مسيطرة وغيورة ربما تخشى المخاطرات وتحب دوما البقاء فى دائرة الآمان لكن في أحيان أخرى تجدها تقدم على تصرفات بها بعض المخاطرة والتي عادة لا تمعن التفكير فيها كثيرا ترتبط بسهولة بالآخرين وهو ما يجعلها قادرة على تكوين صداقات جديدة تحب الأشياء الجميلة وقد تتمادى قليلا في تدليل نفسها عادة تكون هادئة وصبورة ولكن مع ذلك عندما تكون مضغوطة بشكل زائد حاول الإبتعاد عنها قدر المستطاع حتى لا تنفجر غضبا فى وجهك أصدقاء للأبد xoxo؟ فى الغالب هذه هى شخصيتك ، فهى شخصيه رائعة ورغم أن لها معارف كثيرة إلا أنها تحتفظ بقلة من الأصدقاء المقربين إلى قلبها امرأة برج الثور صديقة لديها ولاء وعطاء تحب دائما مساعدة الأخرين وتجدها دوما أول من يظهر فى المواقف الصعبة لتقديم الدعم والمساعدة وإذا وجدت صديق يمتلك نفس ذوقها فى اختيار الطعام ولديه روح الدعابة فإنها ستحتفظ به إلى الآبد,",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q6"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"- شخصية برج الاسد:
وسط مكان مزدحم فشخصيتك صاحبة الضحكة العالية والابتسامة المشرقة المفعمة بالحياة تحب لفت انتباه المحيطين بك وفي العادة تستطيع تحقيق ذلك أيضا تحب الحياة والمرح واللعب لكن إذا حاولت إزعاجها فلن تتردد في الإفصاح عن غضبها وإظهار الوجه الآخر لها شخصيه ذكية قوية الشخصية صريحة في آرائها ومواقفها كما أنها مبدعة ولديها حس فكاهي. هناك أيضا جانب درامي من شخصيتها يجذب الكثيرين إليها التحدي الأكبر بالنسبة لها هو ألا تستخدم قوة شخصيتها بطريقة مبالغ فيها ثقتها الزائدة بنفسها يراها البعض غطرسة وغرور عندما يتعلق الأمر بالعلاقات العاطفية فلن تشعر بالملل أبدا برج الأسد فهو تطيحب العطاء والاهتمام الذي تحبه وتنتظر دوما نفس مقدار الحب والعناية من الطرف الآخر قد لا تمانع من مطاردة الشخص الذي تحبه فالحب واحدا من أهم الأشياء بالنسبة لها في الحياة
الحياة أشبه بمغامرة مثيرة ولا ترضي إلا بالأفضل ورغم ذلك فإنها تقع في الحب بسهولة وعندما يحدث ذلك تكون عاطفية جدا خاصة إذا شعرت أن هذا الشخص هو الأمثل لها مخلصة ووفية للغاية وتبحث عن هذه الصفات في الشخص الذي تحبه هي أيضا كريمة وذات قلب حنون تكرة الروتين والأشياء التقليدية ولن تكون الحياة مملة أبدا معها.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q7"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"شخصية برج العقرب: من أكثر الشخصيات إثارة وغموضاً من بين علامات الأبراج متقلبة المزاج في بعض الأوقات لكنها تعرف جيدا كيف تتغلب على هذا الأمر الأشياء الطبيعية في الحياة، فستجدها مهتمة بالتجارب الروحانية مما يكوّن لديها معتقدات ورؤى خاصة في وصف الحياة تتميز  بأنها شديدة الملاحظة وفد تبدو بلا حيلة على عكس الواقع هي أيضا صريحة وذكية وتكره اللون الرمادي فترى الأشياء في الحياة إما باللون الأبيض أو الأسود عادة ما تفهم امرأة العقرب الناس جيدا تعرف كيف تصيغ أسئلتها لتحصل على الإجابة التي تتمناها قليلا ما تخاف كما أنها مسيطرة وعنيدة في بعض الأحيان عندما تزيد صعوبات الحياة لا تستلم بسهولة بل تحاول استكمال حياتها بإصرار وهي واقفة على قدميها تثق بنفسها كثيرا وتتميز بمداركها الواسعة. شخصيتها معقدة بعض الشيء ومليئة بالأسرار ولا تفصح بسهولة عن الأسرار التي تكمن بداخلها العقرب مع الحب والعلاقات العاطفية عاشقة ومخلصة لشريك حياتها تستطيع الحصول على أي رجل تتمناه لما تتمتع به من شخصية جذابة ولافتة تسعى  إلى تسهيل الحياة على شريكها قدر المستطاع ويظهر ذلك من خلال اهتمامها به والإخلاص له يقال دوم حذروا من    إلحابه العلاقات المصطنعة وتبحث دوما العلاقات المليئة بالحب قد يظن البعض أن امرأة العقرب هي الشخص الأكثر سيطرة في العلاقة بينها وبين الرجل إلا أن هذا ليس صحيحا بالضرورة,",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q8"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"شخصك هو ملك العلاقات حيث أنه يحترف التواصل مع الآخرين. هو أيضا ذكي وملم بكم هائل من المعلومات حول مجالات شتى من الحياة. أدائه سريع، وذكي ويتمتع بسرعة البديهة يحاول طوال الوقت رؤية الأمور من أكثر من منظور ومراجعة كل الخيارات المتاحة ويضع مقارنات مستمرة في عقله بين المميزات والعيوب ليصل إلى ما يجعله راضيا ويحقق له التوازن النفسي.
قد يجد صعوبة في اتخاذ القرار كما أن حالته المزاجية قد تتبدل سريعا، لكنه في الوقت ذاته يتمتع بشخصية مرنة ولا يمانع من السير مع التيار. إلى جانب ذلك فإن لديه اهتمامات عديدة في مجالات مختلفة كما أن شخصيته اجتماعية ويتعلق بكل ما هو مختلف تتمتع بشخصية ساحرة ويحب المغازلة ويصعب عليك مقاومة سحره لايسهل الإيقاع به كما أن تصرفاته غير متوقعة ويتقن إخفاء مشاعره عن الآخرين لاتشعر بالراحة مع فكرة الحب، لذا لا يقع فيه بسهولة، فهو يفكر بعقله أكثر من قلبه ولكن عندما يحب نجد أنه حبيب مرح ولديه لفتات رومانسية رائعة. يعتقد الآخرين أنك متبلد المشاعر ولكنه في الواقع يحجب مشاعره لأنه يحب أن يفكر في كل شيء بعقلانية هو أيضا مستمع جيد ويعلم كيف يدير أفكاره جيدا للوصول إلى ما يحقق له التوازن النفسي الروتين قد يقتل العلاقة لأنه سيخسر بذلك المتعة التي يبحث عنها طوال الوقت.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q9"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"ساحرة، ذكية، ناقدة بالفطرة ومحللة موهوبة. لديها القدرة على الحكم بمنطقية على أفعال الآخرين والمواقف المختلفة.  إلى جعل كل شيء من حولها منظم، فهي شخصية عملية وتهتم كثيرا بالتفاصيل الصغيرة تعشق النظام والترتيب، هي أيضا من الشخصيات المتواضعة والمجتهدة في عملها. تتحمس كثيرا نحو الأهداف السامية والقضايا العظيمة وتبذل كل ما لديها من جهد سعيا وراء خدمة هذه القضايا لا يمكن أن تقابل شخصيت العذراء بملابس غير مهندمة أو لم يتم كيها جيدا. وقد تكون عدوة نفسها عندما تبالغ في تحليل وفحص كل موقف صغير يمر عليها. يختبئ وراء شخصيتها الهادئة والصبورة، بركان فياض من العواطف والمشاعر من الصعب إرضائها، لذا يجب أن يكون شريك حياتها المستقبلي قادرا على تحقيق رغباتها ومتطلعاتها التي قد تكون عالية في بعض الأحيان. تؤمن جداً بوجود الحب الحقيقي والحب الواقعي ولكنها لا تؤمن بهذا الحب المصور في القصص الخيالية بشخصية عاطفية وفياضة المشاعر وتتطلع إلى الكمال. قبل أن تدخل في أية علاقة عاطفية، تقوم بتحليل كل شيء جيدا وتبحث في عيوب الآخر وتحاول اكتشاف حقيقة مشاعره فهي من الشخصيات التي لا تقع في الحب بسهولة أو تعلن عنه ببساطة لكن بمجرد أن تجد الشخص الأمثل لها تصبح عاشقة ومخلصة وشديدة التعلق ويمكن الاعتماد عليها ,",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q10"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"ساحرة، ذكية، ناقدة بالفطرة ومحللة موهوبة. لديها القدرة على الحكم بمنطقية على أفعال الآخرين والمواقف المختلفة.  إلى جعل كل شيء من حولها منظم، فهي شخصية عملية وتهتم كثيرا بالتفاصيل الصغيرة تعشق النظام والترتيب، هي أيضا من الشخصيات المتواضعة والمجتهدة في عملها. تتحمس كثيرا نحو الأهداف السامية والقضايا العظيمة وتبذل كل ما لديها من جهد سعيا وراء خدمة هذه القضايا لا يمكن أن تقابل شخصيت العذراء بملابس غير مهندمة أو لم يتم كيها جيدا. وقد تكون عدوة نفسها عندما تبالغ في تحليل وفحص كل موقف صغير يمر عليها. يختبئ وراء شخصيتها الهادئة والصبورة، بركان فياض من العواطف والمشاعر من الصعب إرضائها، لذا يجب أن يكون شريك حياتها المستقبلي قادرا على تحقيق رغباتها ومتطلعاتها التي قد تكون عالية في بعض الأحيان. تؤمن جداً بوجود الحب الحقيقي والحب الواقعي ولكنها لا تؤمن بهذا الحب المصور في القصص الخيالية بشخصية عاطفية وفياضة المشاعر وتتطلع إلى الكمال. قبل أن تدخل في أية علاقة عاطفية، تقوم بتحليل كل شيء جيدا وتبحث في عيوب الآخر وتحاول اكتشاف حقيقة مشاعره فهي من الشخصيات التي لا تقع في الحب بسهولة أو تعلن عنه ببساطة لكن بمجرد أن تجد الشخص الأمثل لها تصبح عاشقة ومخلصة وشديدة التعلق ويمكن الاعتماد عليها ,",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q11"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"شخصية برج القوس من الشخصيات الفضولية للغاية وتسعى لاكتشاف أشياء جديدة في الحياة كما أنها تبحث عن الحقيقة في كل أمر لديها جانب فلسفي في التفكير وتحب اكتشاف الفرص الجديدة والخيارات المتاحة أمامها ولا تيأس في ذلك شخصيتك متحررة، ساحرة تحب التغيير وعندما تدخل أي مكان تعلم أن معظم الأنظار عليها. هي مستقلة ومتفتحة العقل ولا تعمل وفقا لجدول لأنه يشعرها بالتقيد. تحتاج إلى المرونة في حياتها وتحب أن تشعر بأنها قادرة على تغيير خططها بما يناسبها بشكل أفضل. لا أحد يملي على هذه المرأة ما تفعله فتصرفاتها تنبع منها فقط تبحث عن الشخص الذي يستطيع أن يكون صديقا لها قبل أن يكون شريك حياتها لتكون قادرة على مشاركته المعني الحقيقي للحب. إنها صادقة ومخلصة وتستحق ثقة الآخرين، تستطيع  أن تحتفظ بقدر من الاستقلالية التي تزيدها جاذبية وسحرا في عيون الشخص. إلا أن المشكلة التي تقع دوما، هي صعوبة التقرقة بين الصداقة والحب كما أنها تقع في الحب سريعا ومع ذلك فإنها تحرص على أخذ وقتا كافيا للتعرف على الشخص الذي تحبه قبل الزواج منه. تحب  الشعور بالأمان والحماية من قبل شريك حياتها ولكنها في الوقت ذاته ترفض أن تُوجّه إليها الأوامر طوال الوقت.",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "q12"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"شخصية دبلوماسية ورومانسية وحنونة ولديها جانب روحاني. هي أيضا جذابة وشاعرية وعليك أن تكون حذرا عندما تتعامل مع عواطفها لأنها امرأة حساسة بدرجة كبيرة. تهتم  بمن حولها لكنها غامضة بعض الشئ لديها عقلا نشيطا ويفكر طول الوقت وهي دائمة البحث عن المعنى العميق للحياة تتمتع  بشخصية ساحرة تستطيع أن تلفت أنظار الآخرين إليها، كما أنها ناعمة ومليئة بالأنوثة وليس من السهل خداعها. إذا كنت في علاقة عاطفية مع ، فيفضل أن تكون صريحا معها لأنها إما ستتبع أسلوبها المسيطر معك أو ستختفي عنك ببساطة. من الأفضل أن تكون دبلوماسيا ولطيفا عند التعامل معها ولا تحاول أن تثير غيرتها وغضبها طوال الوقت لأنها ستشعر بهذه الطريقة بأنها غير محببة بالنسبة لك.
امرأة الحوت رومانسية للغاية وعادة ما تفقد نفسها في العلاقة العاطفية. تتمتع أيضا بأنوثة عالية مما يجعلها من الشخصيات الأكثر جذبا للرجال. إلى جانب ذلك، فهي هادئة ويسهل التعامل معها وحساسة جدا وتهتم جدا باحتياجات الآخرين. راعي فقد ألا تستغل عطفها وحنانها وطبيعتها الخدومة حتى لا تخسرها!",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

##------------------------------------------##

if ($data == "#2"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"السؤال الاول: ماهي هوايتكَ المُفضلة ؟",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"الرسم؟",'callback_data'=>"#q1"],['text'=>"الطبخ؟",'callback_data'=>"#q2"]],
[['text'=>"الخياطه؟",'callback_data'=>"#q3"],['text'=>"الرقص؟",'callback_data'=>"#q4"]],
[['text'=>"التصوير؟",'callback_data'=>"#q5"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#q1"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنتَ شخص يُحب العزلة مع إنكَ لديكَ الكثير من الأصدقاء ، أنتَ شخص حنون وصادق في مشاعرِه ، رومانسي قي بعضِ الاحيان ، طبيعي لاتُحب التصنع .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a2"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#q2"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنتَ شخص مرح وخفيف الظل ، لاتؤمن بالحُب مِن النظرة الأولى ، شخصيتُكَ ضعيفة جداً ، مُتكبر ، اصدقائُكَ مُحددون و قليلون .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a2"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#q3"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنت شخص غير طموح تُضيع الكثير من وقتِك ، غالباً ماتفشل في علاقاتِك ، شخصيتُكَ قوية ، غير جاد في عِلاقات الحُب ، شخص قنوع بِما لديه .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a2"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#q4"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنتَ شخص راقي تتميز بِصفات لا يتملكها كُل الناس ، جميل ، في اغلب الأوقات رومانسي ، حساس وتُحب الأناقة .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a2"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#q5"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنتَ شخص رومانسي ، طموح جداً لاتبحث عن الحُب بل تبحث عن الوفاء ، نضراتُك دائماً مُرتبكة ، حساس ، أنتَ شخص يُحب النوم والأحلام ، لديكَ قلق عِندما تواجِه مَن تُحب .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a2"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "a2"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"السؤال الثاني: ماهو لونكَ المُفصل ؟",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"اسود",'callback_data'=>"#w"],['text'=>"اخضر",'callback_data'=>"#w"]],
[['text'=>"ابيض",'callback_data'=>"#w"],['text'=>"احمر",'callback_data'=>"#w"]],
[['text'=>"بنفسجي",'callback_data'=>"#w"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#w"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنت شخص جذاب ، ودود ، نشيط ، عفوي ، تحب إسعاد الآخرين حتى لوكان ذلك ع حساب سعادتك الشخصية ، طيب القلب ، مخلص لعائلتك واصدقائك .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a3"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "a3"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"السؤال الثالث: أختر رقم من الارقام التالية",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"1",'callback_data'=>"#e"],['text'=>"2",'callback_data'=>"#e"]],
[['text'=>"3",'callback_data'=>"#e"],['text'=>"4",'callback_data'=>"#e"]],
[['text'=>"5",'callback_data'=>"#e"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#e"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"مايميزك عن غيرك هو أنك تعتمد ع مبدأ كل شيء أو لاشيء في حياتك ، فأنت لا تختار الوسطية ولا ترضى بأنصاف الحلول ، أما مشاعر الحب لديك تنقلب بيرعة الى كره ونفور ، يعتبرك الآخرين سريع الغضب و مندفع ولا تتصرف بعقلانية .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a4"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "a4"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"السؤال الرابع : ماهو اكثر شي تحبه ؟",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"الغيوم",'callback_data'=>"#r"],['text'=>"الورد",'callback_data'=>"#r"]],
[['text'=>"الشجر",'callback_data'=>"#r"],['text'=>"القطط",'callback_data'=>"#r"]],
[['text'=>"النحل",'callback_data'=>"#r"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#r"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنت  شخصية كريمة جدا لديك الكثير من الطيبة والحنية وانت مثال على الصبر وحب الخير لكل الناس .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a5"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "a5"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"السؤال الخامس: لو خيروك ترسم اشكال هندسية ماذا ستختار ؟",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"مثلث",'callback_data'=>"#t"],['text'=>"مستطيل",'callback_data'=>"#t"]],
[['text'=>"مربع",'callback_data'=>"#t"],['text'=>"مكعب",'callback_data'=>"#t"]],
[['text'=>"دائره",'callback_data'=>"#t"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "#t"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"أنت شخصية قوية وحاسمة وواثق جدا من نفسه ، ذكي وله قدرة كبيرة على التركيز ، يأخذ القرارات الصحيحة والحاسمة ، جدي في تحقيق هدفه ، لا يحب التأخر عن مواعيده ويحرص على الوصول مبكرا ومنهم من يقاطع غيره أثناء الكلام ، ملتزم بالتميز والتفوق ، واضح ولا يحب  اللف والدوران والكذب ، يجيد التعامل مع الأزمات ، مخلص في واجباته وأعماله ، يصلح للقيادة وتولي زمام الأمور ، سريع الغضب ولا يعترف بأخطائه أحياناً .",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- السؤال التالي...",'callback_data'=>"a!!"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "a!!"){
bot('editmessagetext',['chat_id'=>$chatid,
'message_id'=>$message_id,
'text'=>"
🚫 عذراً تم الانتهاء من الاسئلة سيتم اضافه العديد من الاسئلة قريبا...

- قم بمعرفه شخصيتك بالضغط على زر ( تحليل شخصيتي ) في الاسفل.
",
'reply_to_message_id'=>$message->message_id,
'parse_mode'=>"MarkDown",
'reply_markup'=>json_encode(['inline_keyboard'=>[
[['text'=>"- تحليل شخصيتي.",'callback_data'=>"!a!"]],
[['text'=>"- رجوع 🚸",'callback_data'=>"zzzzu"]],]])]);}

if ($data == "!a!"){
bot('sendphoto',['chat_id'=>$chatid,
'photo' =>$pr[array_rand($pr,1)],
'caption' =>"- شخصيتك هي 🙄♥️

$txtfree",
'parse_mode'=>HTML,]);}

